app/Controllers/User.php

SELECT *
FROM `users`
WHERE `email` = 'ther3bornx@gmail.com'
---
    public function forgot_pass()
    {
        if ($this->request->is("post")) {
            $data = [
                'email' => $this->request->getPost('email'),
            ];

            // Check if user exists
            $builder = $this->db->table('users');
            $builder->where('email', $data["email"]);
            $query = $builder->get();